if not banned_list_table then banned_list_table={} end
local string=require('string')
local ls=[[
#[2019.7 YGOCC+2019.10 TCG]

!2019.7 YGOCC
#Forbidden YGOCC
	--							MAIN DECK MONSTERS
33700750 0 -- Anifriend
33700181 0 -- Anifriend
33700072 0 -- Anifriend
33700093 0 -- Anifriend
33700186 0 -- Anifriend
33700079 0 -- Anifriend
33700058 0 -- Anifriend
33700747 0 -- Anifriend
33700745 0 -- Anifriend
	--							EXTRA DECK MONSTERS
33700083 0 -- Anifriend
33700085 0 -- Anifriend
33700082 0 -- Anifriend
91672800 0 -- Percival, Paladawn Light
160009988 0 -- Paintress Angelona (New, was unlimited)
28915253 0 -- Shadowflame Calvary (New, was semi-limited)

	--							SPELLS CARDS
	--							TRAPS CARDS

#Limited YGOCC
171000121 1 --Amethyst-Winged Kuriboh				MAIN DECK MONSTERS
160005445 1 -- Paintress Di Vica
11000533 1 -- Shya Shadowlord
16000233 1 -- Paintress Gorgia
33700054 1 -- Anifriend Red Fox
33700304 1 -- GearGal Veno 
33700065 1 -- Anifriend 
17029601 1 -- Psychether Dreamer 
79854524 1 -- Woodland Wing 
33700746 1 -- Anifriends Sky Impulse 
33700744 1 -- Anifriends Gentoo
53313934 1 -- Mysterious Luster 
160001123 1 -- Paintress Baconia (New, was unlimited)
500311592 1 -- Power Portrait's Cursed Portait Trap 
	--							EXTRA DECK MONSTERS
#16000045 3 -- ESPergear Knight : Gladiator 
500314216 1 -- Supa-Paintress Primp Turkia
33700311 1 -- NEXTGal G
80347321 1 -- Metalfoes Mercuryrider
210424272 1 -- Moon Burst: The Bad Dream
19772604 1 -- Flaric Ebona (new, was banned)
	--							SPELL CARDS
23251031 1 -- Pharaohnic Papyrus of Patience
23251004 1 -- Moon Over the Desert 
33700316 1 -- GearGal Abort
63553459 1 -- Nethergear Unit
#84607229 3 -- Spiritualist Calling (new, unlimited)
160004532 1 -- The Miscomposition of Power Portrait
#28915261 3 -- Shadows Ablaze (new, unlimited)
	--							TRAP CARDS

#Semi-limited YGOCC
	--							MAIN DECK MONSTERS				
53313907 2 -- Mysterious Starquid
32904921 2 -- Aeonbreaker's Bow (new, was limited)
32904923 2 -- Aeonbreaker's Sword (new, was limited)
84607234 2 -- Spiritualist Thalia (new, was limited)
	--							EXTRA DECK MONSTERS
--
	--							SPELL CARDS
53313927 2 -- Mysterious Dimension
210424266 2 -- Battle in the Storm

	--							TRAP CARDS

#FORBIDDEN TCG					===Forbidden===
59537380 0 --Guardragon Agarpain
03679218 0 --Knightmare Mermaid
55623480 0 --妖精伝姫－シラユキ
75732622 0 --トーチ・ゴーレム
22593417 0 --トポロジック・ガンブラー・ドラゴン
10389142 0 --No.42 スターシップ・ギャラクシー・トマホーク
63504681 0 --No.86 H－C ロンゴミアント
54447022 0 --ソウル・チャージ
05043010 0 --ファイアウォール・ドラゴン
05592689 0 --サクリファイス・ロータス
39064822 0 --トロイメア・ゴブリン
04423206 0 --M.X－セイバー インヴォーカー
76794549 0 --アストログラフ・マジシャン
20663556 0 --イレカエル
44910027 0 --ヴィクトリー・ドラゴン
25862681 0 --エンシェント・フェアリー・ドラゴン
53804307 0 --焔征竜－ブラスター
07563579 0 --Emヒグルミ
40318957 0 --EMドクロバット・ジョーカー
17330916 0 --EMモンキーボード
79106360 0 --カオスポッド
90411554 0 --巌征竜－レドックス
08903700 0 --儀式魔人リリーサー
17412721 0 --旧神ノーデン
65536818 0 --源竜星－ボウテンコウ
49684352 0 --虹彩の魔術師
34124316 0 --サイバーポッド
88071625 0 --The tyrant NEPTUNE
61665245 0 --サモン・ソーサレス
48905153 0 --十二獣ドランシア
85115440 0 --十二獣ブルホーン
21593977 0 --処刑人－マキュラ
30539496 0 --真竜皇リトスアジムD
21377582 0 --真竜剣皇マスターP
81122844 0 --発条空母ゼンマイティ
23434538 0 --増殖するG
15341821 0 --ダンディライオン
18326736 0 --星守の騎士 プトレマイオス
33184167 0 --同族感染ウィルス
54719828 0 --No.16 色の支配者ショック·ルーラー
58820923 0 --No.95 ギャラクシーアイズ・ダークマター・ドラゴン
43387895 0 --覇王眷竜スターヴ・ヴェノム
26400609 0 --瀑征竜－タイダル
78706415 0 --ファイバーポッド
93369354 0 --フィッシュボーグ－ガンナー
23558733 0 --フェニキシアン・クラスター・アマリリス
09929398 0 --BF－朧影のゴウフウ
31178212 0 --マジェスペクター・ユニコーン
34206604 0 --魔導サイエンティスト
96782886 0 --メンタルマスター
03078576 0 --八汰烏
34086406 0 --ラヴァルバル·チェイン
57421866 0 --レベル・スティーラー
41482598 0 --悪夢の蜃気楼
44763025 0 --いたずら好きな双子悪魔
19613556 0 --大嵐
17375316 0 --押収
35059553 0 --カイザーコロシアム
74191942 0 --苦渋の選択
42829885 0 --強引な番兵
45986603 0 --強奪
55144522 0 --強欲な壺
04031928 0 --心変わり
23557835 0 --次元融合
57953380 0 --生還の宝札
60682203 0 --大寒波
67616300 0 --チキンレース
67169062 0 --貪欲な壺
69243953 0 --蝶の短剣－エルマ
79571449 0 --天使の施し
11110587 0 --隣の芝刈り
42703248 0 --ハリケーン
18144506 0 --ハーピィの羽根帚
70828912 0 --早すぎた埋葬
34906152 0 --マスドライバー
46448938 0 --魔導書の神判
46411259 0 --突然変異
85602018 0 --遺言状
94220427 0 --RUM－アージェント・カオス・フォース
03298689 0 --RUM－幻影騎士団ラウンチ
27174286 0 --異次元からの帰還
93016201 0 --王宮の弾圧
05851097 0 --虚無空間
57585212 0 --自爆スイッチ
03280747 0 --第六感
64697231 0 --ダスト·シュート
35316708 0 --刻の封印
80604091 0 --血の代償
28566710 0 --ラストバトル！
51858306 0 --Eclipse Wyvern
26692769 0 --Bardiche
#LIMITED TCG						====Limited===
42790071 1 --Multifaker
61901281 1 --Collapserpent
99234526 1 --Wyverbuster
26889158 1 --Salad Gazelle
52155219 1 --Salad Circle
24010609 1 --SS Multirole
35371948 1 --Trickstar Light Stage
89208725 1 --Metaverse
98338152 1 --Sky Striker Mecha Widow Anchor
89399912 1 --嵐征竜－テンペスト
00581014 1 --ダイガスタ・エメラル
69015963 1 --デビル·フランケン
14536035 1 --ダーク・グレファー
07394770 1 --ブリリアント・フュージョン
75500286 1 --封印の黄金櫃
71650854 1 --半魔導帯域
73915051 1 --スケープ・ゴート
71344451 1 --一撃必殺！居合いドロー
28985331 1 --終末の騎士
33508719 1 --メタモルポット
24094258 1 --ヘビーメタルフォーゼ・エレクトラム
74586817 1 --PSYフレームロード・Ω
08949584 1 --ヒーローアライブ
72892473 1 --手札抹殺
52340444 1 --閃刀機－ホーネットビット
64034255 1 --A·ジェネクス·バードマン
45222299 1 --イビリチュア·ガストクラーケ
11877465 1 --イビリチュア·マインドオーガス
99177923 1 --インフェルニティ·デーモン
27552504 1 --永遠の淑女 ベアトリーチェ
12958919 1 --幻銃士
39512984 1 --ジェムナイトマスター・ダイヤ
78872731 1 --十二獣モルモラット
78868119 1 --深海のディーヴァ
58984738 1 --真竜拳士ダイナマイトK
04474060 1 --SPYRAL GEAR－ドローン
78080961 1 --SPYRAL－ジーニアス
81275020 1 --SRベイゴマックス
48063985 1 --聖霊獣騎 カンナホーク
63288573 1 --閃刀姫－カガリ
16226786 1 --深淵の暗殺者
18239909 1 --爆竜剣士イグニスターP
57143342 1 --彼岸の悪鬼 ガトルホッグ
20758643 1 --彼岸の悪鬼 グラバースニッチ
70583986 1 --氷結界の虎王ドゥローレン
33396948 1 --封印されしエクゾディア
07902349 1 --封印されし者の左腕
70903634 1 --封印されし者の右腕
44519536 1 --封印されし者の左足
08124921 1 --封印されし者の右足
10802915 1 --魔界発現世行きデスガイド
89463537 1 --ユニコールの影霊衣
88264978 1 --レッドアイズ·ダークネスメタルドラゴン
16188701 1 --レディ・デバッガー
33782437 1 --一時休戦
66957584 1 --インフェルニティガン
81439173 1 --おろかな埋葬
67723438 1 --緊急テレポート
45305419 1 --継承の印
12580477 1 --サンダー·ボルト
95308449 1 --終焉のカウントダウン
35125879 1 --真竜皇の復活
54631665 1 --SPYRAL RESORT
32807846 1 --増援
14087893 1 --月の書
81674782 1 --次元の裂け目
83764718 1 --死者蘇生
91623717 1 --連鎖爆撃
70368879 1 --成金ゴブリン
22842126 1 --汎神の帝王
73468603 1 --盆回し
15854426 1 --霞の谷の神風
58577036 1 --名推理
14733538 1 --竜呼相打つ
27970830 1 --六武の門
02295440 1 --ワン·フォー·ワン
61740673 1 --王宮の勅命
84749824 1 --神の警告
82732705 1 --スキルドレイン
73599290 1 --ソウルドレイン
17078030 1 --光の護封壁
30241314 1 --マクロコスモス
32723153 1 --マジカル·エクスプロージョン
73628505 1 --テラ・フォーミング
#SEMI LIMITED TCG					===Semi Limited===
65192027 2 --ダーク·アームド·ドラゴン
70711847 2 --Danger Nessie
43694650 2 --Danger Jackalope
99745551 2 --Danger Noodle
68819554 2 --Emダメージ・ジャグラー
28297833 2 --ネクロフェイス
]]
for id in ls:sub(ls:find("!"),ls:find("!",ls:find("!")+1) and ls:find("!",ls:find("!")+1)-1 or -1):gmatch("([0-9]+) 0") do
	banned_list_table[tonumber(id)]=true
end
l:close()
